<?php

	/** Языковые константы для русской версии */
	$i18n = [
		'header-backup-config' => 'Настройки модуля',
		'header-backup-backup_copies' => 'Резервное копирование',
		'header-backup-snapshots' => 'История изменений',
		'group-backup' => 'Настройки резервирования контента',
		'option-enabled' => 'Вести резервное копирование',
		'option-max_timelimit' => 'Максимальное время хранения события (дней)',
		'option-max_save_actions' => 'Максимальное кол-во хранимых событий',
		'group-snapshots' => 'Резервные копии',
		'label-make-snapshot' => 'Создать резервную копию',
		'label-snapshots-files' => 'Файлы',
		'label-snapshots-unpack' => 'Восстановить',
		'label-snapshots-unpack-do' => 'Восстановить',
		'label-snapshots-empty' => 'Резервные копии не найдены',
		'label-create-time' => 'Дата создания',
		'option-backup-directory' => 'Папка с резервнымми копиями',
		'js-backup-make-header' => 'Создание резервной копии',
		'js-backup-make-content' => '<p>Создаётся резервная копия сайта. Это может занять некоторое время.</p>',
		'js-backup-restore-header' => 'Восстановление резервной копии',
		'js-backup-restore-content' => '<p>Вы собираетесь восстановить сайт из резервной копии. Это может занять некоторое время.</p><p>Обратите внимание, что все файлы будут возвращены к состоянию на момент резервирования.</p>',
		'js-restore-backup-do' => 'Восстановить',
		'js-backup-restore-content-do' => "<p style='text-align: center;'>Идет восстановление резервной копии сайта.<br />Это может занять некоторое время.</p>",
		'js-backup-restore-confirm' => "Вы уверены, что хотите восстановить сайт из резервной копии?
Из резервной копии, в том числе, будут восстановлены шаблоны вашего сайта. Если в них вносились изменения или вы устанавливали другие шаблоны, то сайт может потерять работоспособность.",
		'js-backup-restore-title' => 'Восстановление из резервной копии',
		'perms-backup-pages-backup' => 'Резервирование страниц',
		'perms-backup-files-backup' => 'Резервирование файлов',
		'perms-backup-config' => 'Права на работу с настройками',
		'perms-backup-delete' => 'Права на удаление резервных копий файлов',
	];

